examples/soap/Swf Suites4SociaalDomein/dump/06-request-zakLk01 609 Wijzigen Zaakgegevens.xml

<SOAP-ENV:Envelope xsi:schemaLocation="http://www.egem.nl/StUF/sector/zkn/0310 zkn0310-p28\mutatie\zkn0310_msg_mutatie_resolved.xsd" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:BG="http://www.egem.nl/StUF/sector/bg/0310" xmlns:StUF="http://www.egem.nl/StUF/StUF0301" xmlns:ZKN="http://www.egem.nl/StUF/sector/zkn/0310" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
   <SOAP-ENV:Header/>
   <SOAP-ENV:Body>
      <ZKN:zakLk01>
         <ZKN:stuurgegevens>
            <StUF:berichtcode>Lk01</StUF:berichtcode>
            <StUF:zender>
               <StUF:organisatie>1900</StUF:organisatie>
               <StUF:applicatie>GWS4all</StUF:applicatie>
               <StUF:gebruiker>Gebruiker</StUF:gebruiker>
            </StUF:zender>
            <StUF:ontvanger>
               <StUF:organisatie>1900</StUF:organisatie>
               <StUF:applicatie>CDR</StUF:applicatie>
            </StUF:ontvanger>
            <StUF:referentienummer>0822b0b5-464a-43bb-a24a-24057ea3abeb</StUF:referentienummer>
            <StUF:tijdstipBericht>20200507075603923</StUF:tijdstipBericht>
            <StUF:entiteittype>ZAK</StUF:entiteittype>
         </ZKN:stuurgegevens>
         <ZKN:parameters>
            <StUF:mutatiesoort>W</StUF:mutatiesoort>
            <StUF:indicatorOvername>V</StUF:indicatorOvername>
         </ZKN:parameters>
         <ZKN:object StUF:sleutelVerzendend="1900208938" StUF:entiteittype="ZAK" StUF:verwerkingssoort="W">
            <ZKN:identificatie>1900208938</ZKN:identificatie>
            <ZKN:omschrijving>Aanvraag minimaregelingen (Z)</ZKN:omschrijving>
            <ZKN:startdatum>20200309</ZKN:startdatum>
            <ZKN:registratiedatum>20200309</ZKN:registratiedatum>
            <ZKN:einddatumGepland>20200420</ZKN:einddatumGepland>
            <ZKN:isVan StUF:entiteittype="ZAKZKT" StUF:verwerkingssoort="I">
               <ZKN:gerelateerde StUF:entiteittype="ZKT" StUF:verwerkingssoort="I">
                  <ZKN:omschrijving>Aanvraag minima</ZKN:omschrijving>
                  <ZKN:code>B1026</ZKN:code>
                  <ZKN:ingangsdatumObject xsi:nil="true" StUF:noValue="geenWaarde"/>
               </ZKN:gerelateerde>
            </ZKN:isVan>
         </ZKN:object>
         <ZKN:object StUF:sleutelVerzendend="1900208938" StUF:entiteittype="ZAK" StUF:verwerkingssoort="W">
            <ZKN:identificatie>1900208938</ZKN:identificatie>
            <ZKN:omschrijving>Aanvraag minimaregelingen (Z)</ZKN:omschrijving>
            <ZKN:startdatum>20200309</ZKN:startdatum>
            <ZKN:registratiedatum>20200309</ZKN:registratiedatum>
            <ZKN:einddatumGepland>20200530</ZKN:einddatumGepland>
            <ZKN:opschorting>
               <ZKN:indicatie>J</ZKN:indicatie>
               <ZKN:reden>niet tijdig verstrekken inform</ZKN:reden>
            </ZKN:opschorting>
            <ZKN:isVan StUF:entiteittype="ZAKZKT" StUF:verwerkingssoort="I">
               <ZKN:gerelateerde StUF:entiteittype="ZKT" StUF:verwerkingssoort="I">
                  <ZKN:omschrijving>Aanvraag minima</ZKN:omschrijving>
                  <ZKN:code>B1026</ZKN:code>
                  <ZKN:ingangsdatumObject xsi:nil="true" StUF:noValue="geenWaarde"/>
               </ZKN:gerelateerde>
            </ZKN:isVan>
         </ZKN:object>
      </ZKN:zakLk01>
   </SOAP-ENV:Body>
</SOAP-ENV:Envelope>